var muscles_data = {
    "chest-area": ["胸大/小肌", "(Pectoralis major/minor)", //
        "<h4 class='muscle_title'>胸大肌</h4>\
            將手臂拉向胸部的肌肉，兩塊胸大肌位於胸的兩側。胸大肌通常稱為胸肌或胸脯，成扇型，\
            且分裂為大小不等兩部分。在其窄端，兩部分都附著於肱骨之上，在寬的一端，\
            較小的部分附於鎖骨上；較大的部分則附於胸骨和肋骨上面的軟肋骨上，\
            胸肌可將手部向前拉和向內拉近身體，還可使手臂轉動。\
            <hr class='content-separater'>\
        <h4 class='muscle_title'>胸小肌</h4>\
            胸部上側一條三角型的肌肉，在人體中位於胸大肌深層處。\
            胸小肌的起點位於第三、第四，以及第五肋骨上緣靠近肋軟骨處的外肋間肌腱膜。\
            肌纖維會由起點向外上行聚為扁平狀的肌腱，並匯入肩胛骨的喙突內緣，形成一個橋狀的構造。\
            而胸部到上肢的神經及血管則會由僑狀構造下方通過。胸小肌位覆於鎖胸筋膜深層，\
            胸內側神經會穿越胸小肌及鎖胸筋膜。"
    ],
    "deltoid-area": ["三角肌 前/中/後束", "(Anterior/Lateral/posterior deltoid)", //
        "圍繞著肩膀連接的肩胛骨、鎖骨及肱骨，肩部和上臂的大多數運動都離不開三角肌，它使肩膀堅固，\
            並使手臂可以作出多方向的運動。肌肉起止點：三角肌分為三束；前束起於鎖骨，\
            中束起於肩胛骨（的肩峰突），後束起為肩胛骨，止點都在肱骨上端外側。"
    ],
    "abs-area": ["腹直/橫肌,腹外斜肌", "(Rectus/Transverse abdominis, External oblique abdominis)", //
        "<h4 class='muscle_title'>腹直肌</h4>\
        是指軀幹下半部（或稱腹部）的器官，由若干片狀的肌肉保護著，並固定在適當的位置。\
        他們包括兩塊腹直肌，沿著身體前面，從胸廓延伸到骨盆。當腹直肌收縮時，腹部被往內拉。\
        在腹肌共同作用下，可使軀幹向前或向側面運動，甚至扭曲。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>腹橫肌</h4>\
        為深層肌肉，隱藏於腹直肌下方。起點為第 7~12 肋骨外側面、胸腰筋膜、前 2/3 髂嵴、腹股溝韌帶，止於 Linea alba；其腱膜參與構成腹直肌鞘後壁。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>腹內斜肌</h4>\
        腹部軀幹主要的肌肉，為腹部的斜肌之一，這些肌肉輔助腹直肌和腹外斜肌將腹部器官維持在正常位置。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>腹外斜肌</h4>\
        使腹部緊束的斜肌，兩塊腹外斜肌從最低的肋骨延伸到身體前面的中線。在這裡，他們連接成薄而堅固的纖維層。這些肌肉輔助腹直肌和更深的一組斜肌－腹內斜肌－將腹部器官維持在正常位置。"
    ],
    "bicep-area": ["二頭肌", "(Biceps)",
        "使到手臂彎曲的肌肉，連接肩胛骨和前臂的橈骨，收縮使到前臂彎曲。\
        英文名「biceps brachii」的意思是「臂的兩個頭」，\
        因為該肌靠近軀體的一部份分裂為兩部分：長頭與短頭。"
    ],
    "tricep-area": ["三頭肌", "(Triceps)",
        "上臂後面延伸，可伸直或伸展該臂，其英文名「triceps brachii」中的「tri」說明它有三個頭：\
        肱長頭肌附著在肩胛骨上，而另兩個附著在肱骨上。肌肉的遠端有一條有力的腱在肘處附著在尺骨上。"
    ],
    "lap-area": ["股四頭肌", "(Quadriceps)",
        "使膝伸直的一組肌肉，其英文名quadriceps意為四個頭。股四頭肌包括四大塊肌肉：\
        股直肌、股外側肌、股內側肌和股中間肌，此肌肉位於大腿前側。\
        股四頭肌收縮時,拉動膝上的腱並使膝伸直。"
    ],
    "calf-area": ["小腿肌: 比目魚肌,腓腸肌", "(Calf : Soleus, Gastrocnemius)",
        "<h4 class='muscle_title'>比目魚肌</h4>\
        比目魚肌由於其形狀而得名，它在腓骨、脛骨後，橫插在腓腸肌之下，一直插到小腿內側，\
        因此從正面看，小腿內外側下緣都可以看到。比目魚肌是腿部重要結構之一。\
        腓腸肌下方扁平的小腿肌肉，起自腓、脛骨上端後方，因形似比目魚，故名比目魚肌。\
        他與腓腸肌和稱小腿三頭肌。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>腓腸肌</h4>\
        腿部最大的屈肌，其拉丁文「gastrocnemius」意謂腿肚子。腓腸肌沿著小腿背後，\
        從股骨的遠端向下延伸到跟骨。當其收縮時，可使足向下彎曲，並輔助膝蓋彎曲。\
        腓腸肌是透過跟腱與足跟相連接。"
    ],
    "trapezius-area": ["斜方肌,菱形肌", "(Trapezius, Rhomboid)",
        "<h4 class='muscle_title'>斜方肌</h4>\
        將頭部和肩部向後拉的背部肌肉。兩塊斜方肌從脊椎和頭骨底部，經過背部和肩部連接到肩胛骨和鎖骨。\
        他們可使頭部抬起和傾斜，並使雙肩抬起或穩定。兩者共同形成一個稱為斜方型的四邊形，其名稱及來自於此。\
        斜方肌起於枕外隆凸和枕骨上頸線內三分之一段、頸韌帶、第七頸椎棘突、所有胸椎棘突和相應的棘上韌帶。\
        上束纖維向外和側方延續，止於鎖骨的外側三分之一後緣；其功能為上舉及外旋肩胛骨，協助頭部後仰，側屈及旋轉。\
        下束的纖維向上和側方走行。在肩胛附近聚合成一個腱膜，在肩胛岡內側的三角滑面可以滑動，止於其尖端的一個結節；其功能為下壓肩胛骨。\
        中束纖維水平走行，止於肩峰內側緣，肩胛岡後緣的上唇；其功能為內收（縮回）肩胛骨。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>菱形肌</h4>\
        大、小菱肌在肩胛提肌的下方，在斜方肌的深層面，它們為一對菱形狀的扁肌，小菱形肌呈窄帶狀，附著於肩胛骨椎柱緣的上部，\
        在大菱形肌的上方，而大菱形肌薄且扁，幾乎附著於肩胛骨脊柱緣的全部上面，菱形肌雖然非常薄弱，但它負責肩胛骨執行活動時許多的動作。"
    ],
    "lat-area": ["闊背肌", "(Latissimus dorsi)", //
        "將手臂向下和下後拉的背部肌肉。這兩塊三角肌各有一闊端附著於脊椎和骨盆帶上，\
                    較窄的一端則在肩下延伸到肱骨。其拉丁語（及英語）名稱「latissimus dorsi」意為\
                    「背部之最寬闊者」。背闊肌可支撐舉過頭部的手臂，並將手臂從抬高的位置向下移動。\
                    如果你手臂用力向側面伸開，就會感到背闊肌的繃緊。"
    ],
    "teres-area": ["小大圓肌,棘上下肌", "(Teres minor/major, Supraspinatus/Infraspinatus)",
        "<h4 class='muscle_title'>大圓肌</h4>\
        大圓肌位於小圓肌的下側，其下緣為背闊肌的上緣，形狀成條柱狀，大圓肌與小圓肌的關係密不可分，\
        它們同為肩關節旋轉肌群的一部分，大圓肌的附著點在肩胛骨外下緣，則小圓肌位於肩胛骨外緣後方，\
        無論是肩關節旋內、肩關節內收、肩關節後身，大圓肌與小圓肌都會參與作用。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>小圓肌</h4>\
        小圓肌是從人體三分之二的肩胛骨外側緣連接至肱骨大結節的後端由腋神經所支配，\
        小圓肌主要的活動也是從事肩關節外轉以及活動過程中穩定肱骨頭於肩臼內產生的外轉力矩遠小於棘下肌。\
        <hr class='content-separater'>\
    <h4 class='muscle_title'>棘上下肌</h4>\
        棘上肌位在鎖骨的後下方，通過尖峰下面的空隙連接到肱骨大結節上方。\
        而棘下肌位於肩胛骨中段，橫向連結著肩胛骨和肱骨大結節。棘上下肌屬於旋轉肌群的一部分，\
        是極端重要的肌肉群，雖然旋轉肌歸類在小肌肉群，並非主要的力量來源，\
        但它在肩關節大範圍活動時，扮演著穩定上臂骨和肩膀的重要角色。\
            "
    ],
    "bicep-femoris-area": ["股二頭肌", "(Biceps femoris)",
        "交叉在膝關節附近的肌腱群，主要負責控制膝蓋彎曲與大腿伸展的動作。\
        腿後肌群較腿前肌群不容易使用到，基於平衡的原則，\
        當腿前肌群漸漸發達之後，有必要特別鍛鍊一下腿後肌群。"
    ],
    "forearm-area": ["前臂肱肌,腕伸肌", "(Brachioradialis, Carpi ulnaris)",
        "上臂的一條肌肉，屬於肘關節屈肌。肱肌位於肱二頭肌深層，兩條肌肉的功能大致相同，\
        可共同造成肘關節屈曲。肱肌為組成肘窩底部肌肉的單元。"
    ]
}
